#### Готовимся к вечеринке. Считаем бюджет, приглашаем друзей, закупаем вкусняшки =)

##### 1. Дополни недостающую часть программы, чтобы программа заработала <br>

```
#include <iostream>
using namespace std;

int main() {

  cin >> n_guests;
  cout << n_guests * 3;
  return 0;
}
```

##### 2. Дополни недостающую часть программы, чтобы программа вывела общее число друзей <br>

```
#include <iostream>
using namespace std;
int main() {
  int school_friends, family_friends;
  cin >> school_friends >> family_friends;

  return 0;
}
```

##### 3. Рассчитай затраты на вечеринку <br>
Для вечеринки тебе нужны угощения, а значит, надо посчитать бюджет.<br>
Ты знаешь, что угощение для одного гостя стоит минимум **n** рублей.<br>
Посчитав свои финансовые возможности, ты решил ограничить твои расходы сверху - **m** рублей на одного гостя.<br>
Чтобы иметь резерв на непредвиденные траты, ты решил посчитать средний бюджет на одного гостя - буквально среднее арифметическое между **n** и **m**.<br>


Напиши программу, которая  посчитает средний бюджет на одного гостя при заданных ограничениях.<br>

**Формат входных данных**
Два целых числа: **n** - минимальный бюджет на гостя, **m** - максимальный бюджет на гостя<br>

**Формат выходных данных**
Фраза “k rubles” , где **k**  - средний бюджет на гостя<br>


##### 4. Торт кусочками <br>
Пришло время идти за угощениями.<br>
В кондитерской торты продаются порезанными на 8 кусков.<br>
Тебе нужно **n** кусков торта - по одному на каждого гостя.<br>
Ты хочешь сэкономить - покупать торт целиком дешевле - поэтому решил купить как можно больше кусков целыми тортами, а **ОСТАЛЬНЫЕ** докупить отдельными кусками.<br>

Напиши программу, которая  посчитает сколько отдельных кусков надо докупить.<br>

**Формат входных данных**
Одно целое число: **n** - общее количество кусков торта<br>

**Формат выходных данных**
Одно целое число: количество отдельных кусков, которые нужно докупить<br>

##### 5. Целые тортики <br>
В кондитерской торты продаются порезанными на 8 кусков.<br>
Тебе нужно **n** кусков торта - по одному на каждого гостя.<br>

Ты хочешь сэкономить - покупать торт целиком дешевле, он стоит **cake_price** рублей - поэтому решил купить как можно больше кусков тортами, а остальные докупить  отдельными кусками.<br>

Напиши программу, которая  посчитает сколько тортов надо купить и сколько они будут стоить.<br>

**Формат входных данных**
Два целых числа: n - общее количество кусков торта , **cake_price** - цена одного торта<br>

**Формат выходных данных**
Два  целых числа в разных строках: количество **ЦЕЛЫХ** тортов и их стоимость<br>

##### 6. Покупаем тортики <br>
В кондитерской торты продаются порезанными на 8 кусков.<br>

Тебе нужно n кусков торта - по одному на каждого гостя.<br>

Ты хочешь сэкономить - покупать торт целиком дешевле, он стоит **cake_price** рублей - поэтому решил купить как можно больше кусков тортами, а остальные докупить  отдельными кусками, которые стоят по **piece_price**.<br>

Напиши программу, которая  посчитает, сколько стоит всё угощение.<br>

**Формат входных данных**
Три целых числа: **n** - общее количество кусков торта , **cake_price** - цена одного торта, piece_price - цена одного куска

**Формат выходных данных**
Одно целое число: стоимость всего угощения

##### 7. Угости котика <br>
Бабушка решила помочь тебе и прислала к твоей вечеринке коробку из 100 очень вкусных пирожных.<br>
Ты с гостями решил съесть их все, но так чтобы каждому досталось одинаковое число пирожных.<br>
А оставшимися пирожными полакомить кота Мурзика.<br>

Напиши программу, которая  посчитает, сколько пирожных досталось коту, если всего на вечеринке **n** человек.<br>

**Формат входных данных**
Одно целое число: **n** - количество людей на вечеринке<br>

**Формат выходных данных**
Одно целое число : количество пирожных, доставшихся коту<br>


